{"number": 15, "name": "سورة الحجر", "transliteration_en": "Al-Hijr", "translation_en": "The Rock", "total_verses": 99, "revelation_type": "Meccan", "verses": [{"number": 1, "text": " الٓر تِلْكَ ءَايَٰتُ ٱلْكِتَٰبِ وَقُرْءَانٍ مُّبِينٍ", "translation_en": "Alif, Lam, Ra. These are the verses of the Book and a clear Qur'an.", "translation_id": "Alif, laam, raa. (Surat) ini adalah (sebagian dari) ayat-ayat Al-Kitab (yang sempurna), yaitu (ayat-ayat) Al Quran yang memberi penjelasan."}, {"number": 2, "text": "رُّبَمَا يَوَدُّ ٱلَّذِينَ كَفَرُوا۟ لَوْ كَانُوا۟ مُسْلِمِينَ", "translation_en": "Perhaps those who disbelieve will wish that they had been Muslims.", "translation_id": "Orang-orang yang kafir itu seringkali (nanti di akhirat) menginginkan, kiranya mereka dahulu (di dunia) menjadi orang-orang muslim."}, {"number": 3, "text": "ذَرْهُمْ يَأْكُلُوا۟ وَيَتَمَتَّعُوا۟ وَيُلْهِهِمُ ٱلْأَمَلُ فَسَوْفَ يَعْلَمُونَ", "translation_en": "Let them eat and enjoy themselves and be diverted by [false] hope, for they are going to know.", "translation_id": "Biarkanlah mereka (di dunia ini) makan dan bersenang-senang dan dilalaikan oleh angan-angan (kosong), maka kelak mereka akan mengetahui (akibat perbuatan mereka)."}, {"number": 4, "text": "وَمَآ أَهْلَكْنَا مِن قَرْيَةٍ إِلَّا وَلَهَا كِتَابٌ مَّعْلُومٌ", "translation_en": "And We did not destroy any city but that for it was a known decree.", "translation_id": "Dan Kami tiada membinasakan sesuatu negeripun, melainkan ada baginya ketentuan masa yang telah ditetapkan."}, {"number": 5, "text": "مَّا تَسْبِقُ مِنْ أُمَّةٍ أَجَلَهَا وَمَا يَسْتَـْٔخِرُونَ", "translation_en": "No nation will precede its term, nor will they remain thereafter.", "translation_id": "Tidak ada suatu umatpun yang dapat mendahului ajalnya, dan tidak (pula) dapat mengundurkan(nya)."}, {"number": 6, "text": "وَقَالُوا۟ يَٰٓأَيُّهَا ٱلَّذِى نُزِّلَ عَلَيْهِ ٱلذِّكْرُ إِنَّكَ لَمَجْنُونٌ", "translation_en": "And they say, \"O you upon whom the message has been sent down, indeed you are mad.", "translation_id": "Mereka berkata: \"Hai orang yang diturunkan Al Quran kepadanya, sesungguhnya kamu benar-benar orang yang gila."}, {"number": 7, "text": "لَّوْ مَا تَأْتِينَا بِٱلْمَلَٰٓئِكَةِ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ", "translation_en": "Why do you not bring us the angels, if you should be among the truthful?\"", "translation_id": "Mengapa kamu tidak mendatangkan malaikat kepada kami, jika kamu termasuk orang-orang yang benar?\""}, {"number": 8, "text": "مَا نُنَزِّلُ ٱلْمَلَٰٓئِكَةَ إِلَّا بِٱلْحَقِّ وَمَا كَانُوٓا۟ إِذًا مُّنظَرِينَ", "translation_en": "We do not send down the angels except with truth; and the disbelievers would not then be reprieved.", "translation_id": "Kami tidak menurunkan malaikat melainkan dengan benar (untuk membawa azab) dan tiadalah mereka ketika itu diberi tangguh."}, {"number": 9, "text": "إِنَّا نَحْنُ نَزَّلْنَا ٱلذِّكْرَ وَإِنَّا لَهُۥ لَحَٰفِظُونَ", "translation_en": "Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian.", "translation_id": "Sesungguhnya Kami-lah yang menurunkan Al Quran, dan sesungguhnya Kami benar-benar memeliharanya."}, {"number": 10, "text": "وَلَقَدْ أَرْسَلْنَا مِن قَبْلِكَ فِى شِيَعِ ٱلْأَوَّلِينَ", "translation_en": "And We had certainly sent [messengers] before you, [O Muhammad], among the sects of the former peoples.", "translation_id": "Dan sesungguhnya Kami telah mengutus (beberapa rasul) sebelum kamu kepada umat-umat yang terdahulu."}, {"number": 11, "text": "وَمَا يَأْتِيهِم مِّن رَّسُولٍ إِلَّا كَانُوا۟ بِهِۦ يَسْتَهْزِءُونَ", "translation_en": "And no messenger would come to them except that they ridiculed him.", "translation_id": "Dan tidak datang seorang rasulpun kepada mereka, melainkan mereka selalu memperolok-olokkannya."}, {"number": 12, "text": "كَذَٰلِكَ نَسْلُكُهُۥ فِى قُلُوبِ ٱلْمُجْرِمِينَ", "translation_en": "Thus do We insert denial into the hearts of the criminals.", "translation_id": "Demikianlah, Kami mamasukkan (rasa ingkar dan memperolok-olokkan itu) kedalam hati orang-orang yang berdosa (orang-orang kafir),"}, {"number": 13, "text": "لَا يُؤْمِنُونَ بِهِۦ وَقَدْ خَلَتْ سُنَّةُ ٱلْأَوَّلِينَ", "translation_en": "They will not believe in it, while there has already occurred the precedent of the former peoples.", "translation_id": "mereka tidak beriman kepadanya (Al Quran) dan sesungguhnya telah berlalu sunnatullah terhadap orang-orang dahulu."}, {"number": 14, "text": "وَلَوْ فَتَحْنَا عَلَيْهِم بَابًا مِّنَ ٱلسَّمَآءِ فَظَلُّوا۟ فِيهِ يَعْرُجُونَ", "translation_en": "And [even] if We opened to them a gate from the heaven and they continued therein to ascend,", "translation_id": "Dan jika seandainya Kami membukakan kepada mereka salah satu dari (pintu-pintu) langit, lalu mereka terus menerus naik ke atasnya,"}, {"number": 15, "text": "لَقَالُوٓا۟ إِنَّمَا سُكِّرَتْ أَبْصَٰرُنَا بَلْ نَحْنُ قَوْمٌ مَّسْحُورُونَ", "translation_en": "They would say, \"Our eyes have only been dazzled. Rather, we are a people affected by magic.\"", "translation_id": "tentulah mereka berkata: \"Sesungguhnya pandangan kamilah yang dikaburkan, bahkan kami adalah orang orang yang kena sihir\"."}, {"number": 16, "text": "وَلَقَدْ جَعَلْنَا فِى ٱلسَّمَآءِ بُرُوجًا وَزَيَّنَّٰهَا لِلنَّٰظِرِينَ", "translation_en": "And We have placed within the heaven great stars and have beautified it for the observers.", "translation_id": "Dan sesungguhnya Kami telah menciptakan gugusan bintang-bintang (di langit) dan Kami telah menghiasi langit itu bagi orang-orang yang memandang(nya),"}, {"number": 17, "text": "وَحَفِظْنَٰهَا مِن كُلِّ شَيْطَٰنٍ رَّجِيمٍ", "translation_en": "And We have protected it from every devil expelled [from the mercy of Allah]", "translation_id": "dan Kami menjaganya dari tiap-tiap syaitan yang terkutuk,"}, {"number": 18, "text": "إِلَّا مَنِ ٱسْتَرَقَ ٱلسَّمْعَ فَأَتْبَعَهُۥ شِهَابٌ مُّبِينٌ", "translation_en": "Except one who steals a hearing and is pursued by a clear burning flame.", "translation_id": "kecuali syaitan yang mencuri-curi (berita) yang dapat didengar (dari malaikat) lalu dia dikejar oleh semburan api yang terang."}, {"number": 19, "text": "وَٱلْأَرْضَ مَدَدْنَٰهَا وَأَلْقَيْنَا فِيهَا رَوَٰسِىَ وَأَنۢبَتْنَا فِيهَا مِن كُلِّ شَىْءٍ مَّوْزُونٍ", "translation_en": "And the earth - We have spread it and cast therein firmly set mountains and caused to grow therein [something] of every well-balanced thing.", "translation_id": "Dan Kami telah menghamparkan bumi dan menjadikan padanya gunung-gunung dan Kami tumbuhkan padanya segala sesuatu menurut ukuran."}, {"number": 20, "text": "وَجَعَلْنَا لَكُمْ فِيهَا مَعَٰيِشَ وَمَن لَّسْتُمْ لَهُۥ بِرَٰزِقِينَ", "translation_en": "And We have made for you therein means of living and [for] those for whom you are not providers.", "translation_id": "Dan Kami telah menjadikan untukmu di bumi keperluan-keperluan hidup, dan (Kami menciptakan pula) makhluk-makhluk yang kamu sekali-kali bukan pemberi rezeki kepadanya."}, {"number": 21, "text": "وَإِن مِّن شَىْءٍ إِلَّا عِندَنَا خَزَآئِنُهُۥ وَمَا نُنَزِّلُهُۥٓ إِلَّا بِقَدَرٍ مَّعْلُومٍ", "translation_en": "And there is not a thing but that with Us are its depositories, and We do not send it down except according to a known measure.", "translation_id": "Dan tidak ada sesuatupun melainkan pada sisi Kami-lah khazanahnya; dan Kami tidak menurunkannya melainkan dengan ukuran yang tertentu."}, {"number": 22, "text": "وَأَرْسَلْنَا ٱلرِّيَٰحَ لَوَٰقِحَ فَأَنزَلْنَا مِنَ ٱلسَّمَآءِ مَآءً فَأَسْقَيْنَٰكُمُوهُ وَمَآ أَنتُمْ لَهُۥ بِخَٰزِنِينَ", "translation_en": "And We have sent the fertilizing winds and sent down water from the sky and given you drink from it. And you are not its retainers.", "translation_id": "Dan Kami telah meniupkan angin untuk mengawinkan (tumbuh-tumbuhan) dan Kami turunkan hujan dari langit, lalu Kami beri minum kamu dengan air itu, dan sekali-kali bukanlah kamu yang menyimpannya."}, {"number": 23, "text": "وَإِنَّا لَنَحْنُ نُحْىِۦ وَنُمِيتُ وَنَحْنُ ٱلْوَٰرِثُونَ", "translation_en": "And indeed, it is We who give life and cause death, and We are the Inheritor.", "translation_id": "Dan sesungguhnya benar-benar Kami-lah yang menghidupkan dan mematikan dan Kami (pulalah) yang mewarisi."}, {"number": 24, "text": "وَلَقَدْ عَلِمْنَا ٱلْمُسْتَقْدِمِينَ مِنكُمْ وَلَقَدْ عَلِمْنَا ٱلْمُسْتَـْٔخِرِينَ", "translation_en": "And We have already known the preceding [generations] among you, and We have already known the later [ones to come].", "translation_id": "Dan sesungguhnya Kami telah mengetahui orang-orang yang terdahulu daripada-mu dan sesungguhnya Kami mengetahui pula orang-orang yang terkemudian (daripadamu)."}, {"number": 25, "text": "وَإِنَّ رَبَّكَ هُوَ يَحْشُرُهُمْ إِنَّهُۥ حَكِيمٌ عَلِيمٌ", "translation_en": "And indeed, your Lord will gather them; indeed, He is Wise and Knowing.", "translation_id": "Sesungguhnya Tuhanmu, Dialah yang akan menghimpunkan mereka. Sesungguhnya Dia adalah Maha Bijaksana lagi Maha Mengetahui."}, {"number": 26, "text": "وَلَقَدْ خَلَقْنَا ٱلْإِنسَٰنَ مِن صَلْصَٰلٍ مِّنْ حَمَإٍ مَّسْنُونٍ", "translation_en": "And We did certainly create man out of clay from an altered black mud.", "translation_id": "Dan sesungguhnya Kami telah menciptakan manusia (Adam) dari tanah liat kering (yang berasal) dari lumpur hitam yang diberi bentuk."}, {"number": 27, "text": "وَٱلْجَآنَّ خَلَقْنَٰهُ مِن قَبْلُ مِن نَّارِ ٱلسَّمُومِ", "translation_en": "And the jinn We created before from scorching fire.", "translation_id": "Dan Kami telah menciptakan jin sebelum (Adam) dari api yang sangat panas."}, {"number": 28, "text": "وَإِذْ قَالَ رَبُّكَ لِلْمَلَٰٓئِكَةِ إِنِّى خَٰلِقٌۢ بَشَرًا مِّن صَلْصَٰلٍ مِّنْ حَمَإٍ مَّسْنُونٍ", "translation_en": "And [mention, O Muhammad], when your Lord said to the angels, \"I will create a human being out of clay from an altered black mud.", "translation_id": "Dan (ingatlah), ketika Tuhanmu berfirman kepada para malaikat: \"Sesungguhnya Aku akan menciptakan seorang manusia dari tanah liat kering (yang berasal) dari lumpur hitam yang diberi bentuk,"}, {"number": 29, "text": "فَإِذَا سَوَّيْتُهُۥ وَنَفَخْتُ فِيهِ مِن رُّوحِى فَقَعُوا۟ لَهُۥ سَٰجِدِينَ", "translation_en": "And when I have proportioned him and breathed into him of My [created] soul, then fall down to him in prostration.\"", "translation_id": "Maka apabila Aku telah menyempurnakan kejadiannya, dan telah meniup kan kedalamnya ruh (ciptaan)-Ku, maka tunduklah kamu kepadanya dengan bersujud."}, {"number": 30, "text": "فَسَجَدَ ٱلْمَلَٰٓئِكَةُ كُلُّهُمْ أَجْمَعُونَ", "translation_en": "So the angels prostrated - all of them entirely,", "translation_id": "Maka bersujudlah para malaikat itu semuanya bersama-sama,"}, {"number": 31, "text": "إِلَّآ إِبْلِيسَ أَبَىٰٓ أَن يَكُونَ مَعَ ٱلسَّٰجِدِينَ", "translation_en": "Except Iblees, he refused to be with those who prostrated.", "translation_id": "kecuali iblis. Ia enggan ikut besama-sama (malaikat) yang sujud itu."}, {"number": 32, "text": "قَالَ يَٰٓإِبْلِيسُ مَا لَكَ أَلَّا تَكُونَ مَعَ ٱلسَّٰجِدِينَ", "translation_en": "[Allah] said, O Iblees, what is [the matter] with you that you are not with those who prostrate?\"", "translation_id": "Allah berfirman: \"Hai iblis, apa sebabnya kamu tidak (ikut sujud) bersama-sama mereka yang sujud itu?\""}, {"number": 33, "text": "قَالَ لَمْ أَكُن لِّأَسْجُدَ لِبَشَرٍ خَلَقْتَهُۥ مِن صَلْصَٰلٍ مِّنْ حَمَإٍ مَّسْنُونٍ", "translation_en": "He said, \"Never would I prostrate to a human whom You created out of clay from an altered black mud.\"", "translation_id": "Berkata Iblis: \"Aku sekali-kali tidak akan sujud kepada manusia yang Engkau telah menciptakannya dari tanah liat kering (yang berasal) dari lumpur hitam yang diberi bentuk\""}, {"number": 34, "text": "قَالَ فَٱخْرُجْ مِنْهَا فَإِنَّكَ رَجِيمٌ", "translation_en": "[Allah] said, \"Then get out of it, for indeed, you are expelled.", "translation_id": "Allah berfirman: \"Keluarlah dari surga, karena sesungguhnya kamu terkutuk,"}, {"number": 35, "text": "وَإِنَّ عَلَيْكَ ٱللَّعْنَةَ إِلَىٰ يَوْمِ ٱلدِّينِ", "translation_en": "And indeed, upon you is the curse until the Day of Recompense.\"", "translation_id": "dan sesungguhnya kutukan itu tetap menimpamu sampai hari kiamat\"."}, {"number": 36, "text": "قَالَ رَبِّ فَأَنظِرْنِىٓ إِلَىٰ يَوْمِ يُبْعَثُونَ", "translation_en": "He said, \"My Lord, then reprieve me until the Day they are resurrected.\"", "translation_id": "Berkata iblis: \"Ya Tuhanku, (kalau begitu) maka beri tangguhlah kepadaku sampai hari (manusia) dibangkitkan,"}, {"number": 37, "text": "قَالَ فَإِنَّكَ مِنَ ٱلْمُنظَرِينَ", "translation_en": "[Allah] said, \"So indeed, you are of those reprieved", "translation_id": "Allah berfirman: \"(Kalau begitu) maka sesungguhnya kamu termasuk orang-orang yang diberi tangguh,"}, {"number": 38, "text": "إِلَىٰ يَوْمِ ٱلْوَقْتِ ٱلْمَعْلُومِ", "translation_en": "Until the Day of the time well-known.\"", "translation_id": "sampai hari (suatu) waktu yang telah ditentukan,"}, {"number": 39, "text": "قَالَ رَبِّ بِمَآ أَغْوَيْتَنِى لَأُزَيِّنَنَّ لَهُمْ فِى ٱلْأَرْضِ وَلَأُغْوِيَنَّهُمْ أَجْمَعِينَ", "translation_en": "[Iblees] said, \"My Lord, because You have put me in error, I will surely make [disobedience] attractive to them on earth, and I will mislead them all", "translation_id": "Iblis berkata: \"Ya Tuhanku, oleh sebab Engkau telah memutuskan bahwa aku sesat, pasti aku akan menjadikan mereka memandang baik (perbuatan maksiat) di muka bumi, dan pasti aku akan menyesatkan mereka semuanya,"}, {"number": 40, "text": "إِلَّا عِبَادَكَ مِنْهُمُ ٱلْمُخْلَصِينَ", "translation_en": "Except, among them, Your chosen servants.\"", "translation_id": "kecuali hamba-hamba Engkau yang mukhlis di antara mereka\"."}, {"number": 41, "text": "قَالَ هَٰذَا صِرَٰطٌ عَلَىَّ مُسْتَقِيمٌ", "translation_en": "[Allah] said, \"This is a path [of return] to Me [that is] straight.", "translation_id": "Allah berfirman: \"Ini adalah jalan yang lurus, kewajiban Aku-lah (menjaganya)."}, {"number": 42, "text": "إِنَّ عِبَادِى لَيْسَ لَكَ عَلَيْهِمْ سُلْطَٰنٌ إِلَّا مَنِ ٱتَّبَعَكَ مِنَ ٱلْغَاوِينَ", "translation_en": "Indeed, My servants - no authority will you have over them, except those who follow you of the deviators.", "translation_id": "Sesungguhnya hamba-hamba-Ku tidak ada kekuasaan bagimu terhadap mereka, kecuali orang-orang yang mengikut kamu, yaitu orang-orang yang sesat."}, {"number": 43, "text": "وَإِنَّ جَهَنَّمَ لَمَوْعِدُهُمْ أَجْمَعِينَ", "translation_en": "And indeed, Hell is the promised place for them all.", "translation_id": "Dan sesungguhnya Jahannam itu benar-benar tempat yang telah diancamkan kepada mereka (pengikut-pengikut syaitan) semuanya."}, {"number": 44, "text": "لَهَا سَبْعَةُ أَبْوَٰبٍ لِّكُلِّ بَابٍ مِّنْهُمْ جُزْءٌ مَّقْسُومٌ", "translation_en": "It has seven gates; for every gate is of them a portion designated.\"", "translation_id": "Jahannam itu mempunyai tujuh pintu. Tiap-tiap pintu (telah ditetapkan) untuk golongan yang tertentu dari mereka."}, {"number": 45, "text": "إِنَّ ٱلْمُتَّقِينَ فِى جَنَّٰتٍ وَعُيُونٍ", "translation_en": "Indeed, the righteous will be within gardens and springs.", "translation_id": "Sesungguhnya orang-orang yang bertakwa itu berada dalam surga (taman-taman) dan (di dekat) mata air-mata air (yang mengalir)."}, {"number": 46, "text": "ٱدْخُلُوهَا بِسَلَٰمٍ ءَامِنِينَ", "translation_en": "[Having been told], \"Enter it in peace, safe [and secure].\"", "translation_id": "(Dikatakan kepada mereka): \"Masuklah ke dalamnya dengan sejahtera lagi aman\""}, {"number": 47, "text": "وَنَزَعْنَا مَا فِى صُدُورِهِم مِّنْ غِلٍّ إِخْوَٰنًا عَلَىٰ سُرُرٍ مُّتَقَٰبِلِينَ", "translation_en": "And We will remove whatever is in their breasts of resentment, [so they will be] brothers, on thrones facing each other.", "translation_id": "Dan Kami lenyapkan segala rasa dendam yang berada dalam hati mereka, sedang mereka merasa bersaudara duduk berhadap-hadapan di atas dipan-dipan."}, {"number": 48, "text": "لَا يَمَسُّهُمْ فِيهَا نَصَبٌ وَمَا هُم مِّنْهَا بِمُخْرَجِينَ", "translation_en": "No fatigue will touch them therein, nor from it will they [ever] be removed.", "translation_id": "Mereka tidak merasa lelah di dalamnya dan mereka sekali-kali tidak akan dikeluarkan daripadanya."}, {"number": 49, "text": "نَبِّئْ عِبَادِىٓ أَنِّىٓ أَنَا ٱلْغَفُورُ ٱلرَّحِيمُ", "translation_en": "[O Muhammad], inform My servants that it is I who am the Forgiving, the Merciful.", "translation_id": "Kabarkanlah kepada hamba-hamba-Ku, bahwa sesungguhnya Aku-lah Yang Maha Pengampun lagi Maha Penyayang,"}, {"number": 50, "text": "وَأَنَّ عَذَابِى هُوَ ٱلْعَذَابُ ٱلْأَلِيمُ", "translation_en": "And that it is My punishment which is the painful punishment.", "translation_id": "dan bahwa sesungguhnya azab-Ku adalah azab yang sangat pedih."}, {"number": 51, "text": "وَنَبِّئْهُمْ عَن ضَيْفِ إِبْرَٰهِيمَ", "translation_en": "And inform them about the guests of Abraham,", "translation_id": "Dan kabarkanlah kepada mereka tentang tamu-tamu Ibrahim."}, {"number": 52, "text": "إِذْ دَخَلُوا۟ عَلَيْهِ فَقَالُوا۟ سَلَٰمًا قَالَ إِنَّا مِنكُمْ وَجِلُونَ", "translation_en": "When they entered upon him and said, \"Peace.\" [Abraham] said, \"Indeed, we are fearful of you.\"", "translation_id": "Ketika mereka masuk ke tempatnya, lalu mereka mengucapkan: \"Salaam\". Berkata Ibrahim: \"Sesungguhnya kami merasa takut kepadamu\"."}, {"number": 53, "text": "قَالُوا۟ لَا تَوْجَلْ إِنَّا نُبَشِّرُكَ بِغُلَٰمٍ عَلِيمٍ", "translation_en": "[The angels] said, \"Fear not. Indeed, we give you good tidings of a learned boy.\"", "translation_id": "Mereka berkata: \"Janganlah kamu merasa takut, sesungguhnya kami memberi kabar gembira kepadamu dengan (kelahiran seorang) anak laki-laki (yang akan menjadi) orang yang alim\"."}, {"number": 54, "text": "قَالَ أَبَشَّرْتُمُونِى عَلَىٰٓ أَن مَّسَّنِىَ ٱلْكِبَرُ فَبِمَ تُبَشِّرُونَ", "translation_en": "He said, \"Have you given me good tidings although old age has come upon me? Then of what [wonder] do you inform?\"", "translation_id": "Berkata Ibrahim: \"Apakah kamu memberi kabar gembira kepadaku padahal usiaku telah lanjut, maka dengan cara bagaimanakah (terlaksananya) berita gembira yang kamu kabarkan ini?\""}, {"number": 55, "text": "قَالُوا۟ بَشَّرْنَٰكَ بِٱلْحَقِّ فَلَا تَكُن مِّنَ ٱلْقَٰنِطِينَ", "translation_en": "They said, \"We have given you good tidings in truth, so do not be of the despairing.\"", "translation_id": "Mereka menjawab: \"Kami menyampaikan kabar gembira kepadamu dengan benar, maka janganlah kamu termasuk orang-orang yang berputus asa\"."}, {"number": 56, "text": "قَالَ وَمَن يَقْنَطُ مِن رَّحْمَةِ رَبِّهِۦٓ إِلَّا ٱلضَّآلُّونَ", "translation_en": "He said, \"And who despairs of the mercy of his Lord except for those astray?\"", "translation_id": "Ibrahim berkata: \"Tidak ada orang yang berputus asa dari rahmat Tuhan-nya, kecuali orang-orang yang sesat\"."}, {"number": 57, "text": "قَالَ فَمَا خَطْبُكُمْ أَيُّهَا ٱلْمُرْسَلُونَ", "translation_en": "[Abraham] said, \"Then what is your business [here], O messengers?\"", "translation_id": "Berkata (pula) Ibrahim: \"Apakah urusanmu yang penting (selain itu), hai para utusan?\""}, {"number": 58, "text": "قَالُوٓا۟ إِنَّآ أُرْسِلْنَآ إِلَىٰ قَوْمٍ مُّجْرِمِينَ", "translation_en": "They said, \"Indeed, we have been sent to a people of criminals,", "translation_id": "Mereka menjawab: \"Kami sesungguhnya diutus kepada kaum yang berdosa,"}, {"number": 59, "text": "إِلَّآ ءَالَ لُوطٍ إِنَّا لَمُنَجُّوهُمْ أَجْمَعِينَ", "translation_en": "Except the family of Lot; indeed, we will save them all", "translation_id": "kecuali Luth beserta pengikut-pengikutnya. Sesungguhnya Kami akan menyelamatkan mereka semuanya,"}, {"number": 60, "text": "إِلَّا ٱمْرَأَتَهُۥ قَدَّرْنَآ إِنَّهَا لَمِنَ ٱلْغَٰبِرِينَ", "translation_en": "Except his wife.\" Allah decreed that she is of those who remain behind.", "translation_id": "kecuali istrinya. Kami telah menentukan, bahwa sesungguhnya ia itu termasuk orang-orang yang tertinggal (bersama-sama dengan orang kafir lainnya)\"."}, {"number": 61, "text": "فَلَمَّا جَآءَ ءَالَ لُوطٍ ٱلْمُرْسَلُونَ", "translation_en": "And when the messengers came to the family of Lot,", "translation_id": "Maka tatkala para utusan itu datang kepada kaum Luth, beserta pengikut pengikutnya,"}, {"number": 62, "text": "قَالَ إِنَّكُمْ قَوْمٌ مُّنكَرُونَ", "translation_en": "He said, \"Indeed, you are people unknown.\"", "translation_id": "ia berkata: \"Sesungguhnya kamu adalah orang-orang yang tidak dikenal\"."}, {"number": 63, "text": "قَالُوا۟ بَلْ جِئْنَٰكَ بِمَا كَانُوا۟ فِيهِ يَمْتَرُونَ", "translation_en": "They said, \"But we have come to you with that about which they were disputing,", "translation_id": "Para utusan menjawab: \"Sebenarnya kami ini datang kepadamu dengan membawa azab yang selalu mereka dustakan."}, {"number": 64, "text": "وَأَتَيْنَٰكَ بِٱلْحَقِّ وَإِنَّا لَصَٰدِقُونَ", "translation_en": "And we have come to you with truth, and indeed, we are truthful.", "translation_id": "Dan kami datang kepadamu membawa kebenaran dan sesungguhnya kami betul-betul orang-orang benar."}, {"number": 65, "text": "فَأَسْرِ بِأَهْلِكَ بِقِطْعٍ مِّنَ ٱلَّيْلِ وَٱتَّبِعْ أَدْبَٰرَهُمْ وَلَا يَلْتَفِتْ مِنكُمْ أَحَدٌ وَٱمْضُوا۟ حَيْثُ تُؤْمَرُونَ", "translation_en": "So set out with your family during a portion of the night and follow behind them and let not anyone among you look back and continue on to where you are commanded.\"", "translation_id": "Maka pergilah kamu di akhir malam dengan membawa keluargamu, dan ikutlah mereka dari belakang dan janganlah seorangpun di antara kamu menoleh kebelakang dan teruskanlah perjalanan ke tempat yang di perintahkan kepadamu\"."}, {"number": 66, "text": "وَقَضَيْنَآ إِلَيْهِ ذَٰلِكَ ٱلْأَمْرَ أَنَّ دَابِرَ هَٰٓؤُلَآءِ مَقْطُوعٌ مُّصْبِحِينَ", "translation_en": "And We conveyed to him [the decree] of that matter: that those [sinners] would be eliminated by early morning.", "translation_id": "Dan telah Kami wahyukan kepadanya (Luth) perkara itu, yaitu bahwa mereka akan ditumpas habis di waktu subuh."}, {"number": 67, "text": "وَجَآءَ أَهْلُ ٱلْمَدِينَةِ يَسْتَبْشِرُونَ", "translation_en": "And the people of the city came rejoicing.", "translation_id": "Dan datanglah penduduk kota itu (ke rumah Luth) dengan gembira (karena) kedatangan tamu-tamu itu."}, {"number": 68, "text": "قَالَ إِنَّ هَٰٓؤُلَآءِ ضَيْفِى فَلَا تَفْضَحُونِ", "translation_en": "[Lot] said, \"Indeed, these are my guests, so do not shame me.", "translation_id": "Luth berkata: \"Sesungguhnya mereka adalah tamuku; maka janganlah kamu memberi malu (kepadaku),"}, {"number": 69, "text": "وَٱتَّقُوا۟ ٱللَّهَ وَلَا تُخْزُونِ", "translation_en": "And fear Allah and do not disgrace me.\"", "translation_id": "dan bertakwalah kepada Allah dan janganlah kamu membuat aku terhina\"."}, {"number": 70, "text": "قَالُوٓا۟ أَوَلَمْ نَنْهَكَ عَنِ ٱلْعَٰلَمِينَ", "translation_en": "They said, \"Have we not forbidden you from [protecting] people?\"", "translation_id": "Mereka berkata: \"Dan bukankah kami telah melarangmu dari (melindungi) manusia?\""}, {"number": 71, "text": "قَالَ هَٰٓؤُلَآءِ بَنَاتِىٓ إِن كُنتُمْ فَٰعِلِينَ", "translation_en": "[Lot] said, \"These are my daughters - if you would be doers [of lawful marriage].\"", "translation_id": "Luth berkata: \"Inilah puteri-puteriku (kawinlah dengan mereka), jika kamu hendak berbuat (secara yang halal)\"."}, {"number": 72, "text": "لَعَمْرُكَ إِنَّهُمْ لَفِى سَكْرَتِهِمْ يَعْمَهُونَ", "translation_en": "By your life, [O Muhammad], indeed they were, in their intoxication, wandering blindly.", "translation_id": "(Allah berfirman): \"Demi umurmu (Muhammad), sesungguhnya mereka terombang-ambing di dalam kemabukan (kesesatan)\"."}, {"number": 73, "text": "فَأَخَذَتْهُمُ ٱلصَّيْحَةُ مُشْرِقِينَ", "translation_en": "So the shriek seized them at sunrise.", "translation_id": "Maka mereka dibinasakan oleh suara keras yang mengguntur, ketika matahari akan terbit."}, {"number": 74, "text": "فَجَعَلْنَا عَٰلِيَهَا سَافِلَهَا وَأَمْطَرْنَا عَلَيْهِمْ حِجَارَةً مِّن سِجِّيلٍ", "translation_en": "And We made the highest part [of the city] its lowest and rained upon them stones of hard clay.", "translation_id": "Maka Kami jadikan bahagian atas kota itu terbalik ke bawah dan Kami hujani mereka dengan batu dari tanah yang keras."}, {"number": 75, "text": "إِنَّ فِى ذَٰلِكَ لَءَايَٰتٍ لِّلْمُتَوَسِّمِينَ", "translation_en": "Indeed in that are signs for those who discern.", "translation_id": "Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda (kekuasaan Allah) bagi orang-orang yang memperhatikan tanda-tanda."}, {"number": 76, "text": "وَإِنَّهَا لَبِسَبِيلٍ مُّقِيمٍ", "translation_en": "And indeed, those cities are [situated] on an established road.", "translation_id": "Dan sesungguhnya kota itu benar-benar terletak di jalan yang masih tetap (dilalui manusia)."}, {"number": 77, "text": "إِنَّ فِى ذَٰلِكَ لَءَايَةً لِّلْمُؤْمِنِينَ", "translation_en": "Indeed in that is a sign for the believers.", "translation_id": "Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda (kekuasaan Allah) bagi orang-orang yang beriman."}, {"number": 78, "text": "وَإِن كَانَ أَصْحَٰبُ ٱلْأَيْكَةِ لَظَٰلِمِينَ", "translation_en": "And the companions of the thicket were [also] wrongdoers.", "translation_id": "Dan sesungguhnya adalah penduduk Aikah itu benar-benar kaum yang zalim,"}, {"number": 79, "text": "فَٱنتَقَمْنَا مِنْهُمْ وَإِنَّهُمَا لَبِإِمَامٍ مُّبِينٍ", "translation_en": "So We took retribution from them, and indeed, both [cities] are on a clear highway.", "translation_id": "maka Kami membinasakan mereka. Dan sesungguhnya kedua kota itu benar-benar terletak di jalan umum yang terang."}, {"number": 80, "text": "وَلَقَدْ كَذَّبَ أَصْحَٰبُ ٱلْحِجْرِ ٱلْمُرْسَلِينَ", "translation_en": "And certainly did the companions of Thamud deny the messengers.", "translation_id": "Dan sesungguhnya penduduk-penduduk kota Al Hijr telah mendustakan rasul-rasul,"}, {"number": 81, "text": "وَءَاتَيْنَٰهُمْ ءَايَٰتِنَا فَكَانُوا۟ عَنْهَا مُعْرِضِينَ", "translation_en": "And We gave them Our signs, but from them they were turning away.", "translation_id": "dan Kami telah mendatangkan kepada mereka tanda-tanda (kekuasaan) Kami, tetapi mereka selalu berpaling daripadanya,"}, {"number": 82, "text": "وَكَانُوا۟ يَنْحِتُونَ مِنَ ٱلْجِبَالِ بُيُوتًا ءَامِنِينَ", "translation_en": "And they used to carve from the mountains, houses, feeling secure.", "translation_id": "dan mereka memahat rumah-rumah dari gunung-gunung batu (yang didiami) dengan aman."}, {"number": 83, "text": "فَأَخَذَتْهُمُ ٱلصَّيْحَةُ مُصْبِحِينَ", "translation_en": "But the shriek seized them at early morning.", "translation_id": "Maka mereka dibinasakan oleh suara keras yang mengguntur di waktu pagi,"}, {"number": 84, "text": "فَمَآ أَغْنَىٰ عَنْهُم مَّا كَانُوا۟ يَكْسِبُونَ", "translation_en": "So nothing availed them [from] what they used to earn.", "translation_id": "maka tak dapat menolong mereka, apa yang telah mereka usahakan."}, {"number": 85, "text": "وَمَا خَلَقْنَا ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ وَمَا بَيْنَهُمَآ إِلَّا بِٱلْحَقِّ وَإِنَّ ٱلسَّاعَةَ لَءَاتِيَةٌ فَٱصْفَحِ ٱلصَّفْحَ ٱلْجَمِيلَ", "translation_en": "And We have not created the heavens and earth and that between them except in truth. And indeed, the Hour is coming; so forgive with gracious forgiveness.", "translation_id": "Dan tidaklah Kami ciptakan langit dan bumi dan apa yang ada di antara keduanya, melainkan dengan benar. Dan sesungguhnya saat (kiamat) itu pasti akan datang, maka maafkanlah (mereka) dengan cara yang baik."}, {"number": 86, "text": "إِنَّ رَبَّكَ هُوَ ٱلْخَلَّٰقُ ٱلْعَلِيمُ", "translation_en": "Indeed, your Lord - He is the Knowing Creator.", "translation_id": "Sesungguhnya Tuhanmu, Dialah Yang Maha Pencipta lagi Maha Mengetahui."}, {"number": 87, "text": "وَلَقَدْ ءَاتَيْنَٰكَ سَبْعًا مِّنَ ٱلْمَثَانِى وَٱلْقُرْءَانَ ٱلْعَظِيمَ", "translation_en": "And We have certainly given you, [O Muhammad], seven of the often repeated [verses] and the great Qur'an.", "translation_id": "Dan sesungguhnya Kami telah berikan kepadamu tujuh ayat yang dibaca berulang-ulang dan Al Quran yang agung."}, {"number": 88, "text": "لَا تَمُدَّنَّ عَيْنَيْكَ إِلَىٰ مَا مَتَّعْنَا بِهِۦٓ أَزْوَٰجًا مِّنْهُمْ وَلَا تَحْزَنْ عَلَيْهِمْ وَٱخْفِضْ جَنَاحَكَ لِلْمُؤْمِنِينَ", "translation_en": "Do not extend your eyes toward that by which We have given enjoyment to [certain] categories of the disbelievers, and do not grieve over them. And lower your wing to the believers", "translation_id": "Janganlah sekali-kali kamu menunjukkan pandanganmu kepada kenikmatan hidup yang telah Kami berikan kepada beberapa golongan di antara mereka (orang-orang kafir itu), dan janganlah kamu bersedih hati terhadap mereka dan berendah dirilah kamu terhadap orang-orang yang beriman."}, {"number": 89, "text": "وَقُلْ إِنِّىٓ أَنَا ٱلنَّذِيرُ ٱلْمُبِينُ", "translation_en": "And say, \"Indeed, I am the clear warner\" -", "translation_id": "Dan katakanlah: \"Sesungguhnya aku adalah pemberi peringatan yang menjelaskan\"."}, {"number": 90, "text": "كَمَآ أَنزَلْنَا عَلَى ٱلْمُقْتَسِمِينَ", "translation_en": "Just as We had revealed [scriptures] to the separators", "translation_id": "Sebagaimana (Kami telah memberi peringatan), Kami telah menurunkan (azab) kepada orang-orang yang membagi-bagi (Kitab Allah),"}, {"number": 91, "text": "ٱلَّذِينَ جَعَلُوا۟ ٱلْقُرْءَانَ عِضِينَ", "translation_en": "Who have made the Qur'an into portions.", "translation_id": "(yaitu) orang-orang yang telah menjadikan Al Quran itu terbagi-bagi."}, {"number": 92, "text": "فَوَرَبِّكَ لَنَسْـَٔلَنَّهُمْ أَجْمَعِينَ", "translation_en": "So by your Lord, We will surely question them all", "translation_id": "Maka demi Tuhanmu, Kami pasti akan menanyai mereka semua,"}, {"number": 93, "text": "عَمَّا كَانُوا۟ يَعْمَلُونَ", "translation_en": "About what they used to do.", "translation_id": "tentang apa yang telah mereka kerjakan dahulu."}, {"number": 94, "text": "فَٱصْدَعْ بِمَا تُؤْمَرُ وَأَعْرِضْ عَنِ ٱلْمُشْرِكِينَ", "translation_en": "Then declare what you are commanded and turn away from the polytheists.", "translation_id": "Maka sampaikanlah olehmu secara terang-terangan segala apa yang diperintahkan (kepadamu) dan berpalinglah dari orang-orang yang musyrik."}, {"number": 95, "text": "إِنَّا كَفَيْنَٰكَ ٱلْمُسْتَهْزِءِينَ", "translation_en": "Indeed, We are sufficient for you against the mockers", "translation_id": "Sesungguhnya Kami memelihara kamu daripada (kejahatan) orang-orang yang memperolok-olokkan (kamu),"}, {"number": 96, "text": "ٱلَّذِينَ يَجْعَلُونَ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَسَوْفَ يَعْلَمُونَ", "translation_en": "Who make [equal] with Allah another deity. But they are going to know.", "translation_id": "(Yaitu) orang-orang yang menganggap adanya tuhan yang lain di samping Allah; maka mereka kelak akan mengetahui (akibat-akibatnya)."}, {"number": 97, "text": "وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ", "translation_en": "And We already know that your breast is constrained by what they say.", "translation_id": "Dan Kami sungguh-sungguh mengetahui, bahwa dadamu menjadi sempit disebabkan apa yang mereka ucapkan,"}, {"number": 98, "text": "فَسَبِّحْ بِحَمْدِ رَبِّكَ وَكُن مِّنَ ٱلسَّٰجِدِينَ", "translation_en": "So exalt [Allah] with praise of your Lord and be of those who prostrate [to Him].", "translation_id": "maka bertasbihlah dengan memuji Tuhanmu dan jadilah kamu di antara orang-orang yang bersujud (shalat),"}, {"number": 99, "text": "وَٱعْبُدْ رَبَّكَ حَتَّىٰ يَأْتِيَكَ ٱلْيَقِينُ", "translation_en": "And worship your Lord until there comes to you the certainty (death).", "translation_id": "dan sembahlah Tuhanmu sampai datang kepadamu yang diyakini (ajal)."}]}