{"number": 50, "name": "سورة ق", "transliteration_en": "Qaaf", "translation_en": "The letter Qaaf", "total_verses": 45, "revelation_type": "Meccan", "verses": [{"number": 1, "text": " قٓ وَٱلْقُرْءَانِ ٱلْمَجِيدِ", "translation_en": "Qaf. By the honored Qur'an...", "translation_id": "Qaaf Demi Al Quran yang sangat mulia."}, {"number": 2, "text": "بَلْ عَجِبُوٓا۟ أَن جَآءَهُم مُّنذِرٌ مِّنْهُمْ فَقَالَ ٱلْكَٰفِرُونَ هَٰذَا شَىْءٌ عَجِيبٌ", "translation_en": "But they wonder that there has come to them a warner from among themselves, and the disbelievers say, \"This is an amazing thing.", "translation_id": "(Mereka tidak menerimanya) bahkan mereka tercengang karena telah datang kepada mereka seorang pemberi peringatan dari (kalangan) mereka sendiri, maka berkatalah orang-orang kafir: \"Ini adalah suatu yang amat ajaib\"."}, {"number": 3, "text": "أَءِذَا مِتْنَا وَكُنَّا تُرَابًا ذَٰلِكَ رَجْعٌۢ بَعِيدٌ", "translation_en": "When we have died and have become dust, [we will return to life]? That is a distant return.\"", "translation_id": "Apakah kami setelah mati dan setelah menjadi tanah (kami akan kembali lagi)?, itu adalah suatu pengembalian yang tidak mungkin."}, {"number": 4, "text": "قَدْ عَلِمْنَا مَا تَنقُصُ ٱلْأَرْضُ مِنْهُمْ وَعِندَنَا كِتَٰبٌ حَفِيظٌۢ", "translation_en": "We know what the earth diminishes of them, and with Us is a retaining record.", "translation_id": "Sesungguhnya Kami telah mengetahui apa yang dihancurkan oleh bumi dari (tubuh-tubuh) mereka, dan pada sisi Kamipun ada kitab yang memelihara (mencatat)."}, {"number": 5, "text": "بَلْ كَذَّبُوا۟ بِٱلْحَقِّ لَمَّا جَآءَهُمْ فَهُمْ فِىٓ أَمْرٍ مَّرِيجٍ", "translation_en": "But they denied the truth when it came to them, so they are in a confused condition.", "translation_id": "Sebenarnya, mereka telah mendustakan kebenaran tatkala kebenaran itu datang kepada mereka, maka mereka berada dalam keadaan kacau balau."}, {"number": 6, "text": "أَفَلَمْ يَنظُرُوٓا۟ إِلَى ٱلسَّمَآءِ فَوْقَهُمْ كَيْفَ بَنَيْنَٰهَا وَزَيَّنَّٰهَا وَمَا لَهَا مِن فُرُوجٍ", "translation_en": "Have they not looked at the heaven above them - how We structured it and adorned it and [how] it has no rifts?", "translation_id": "Maka apakah mereka tidak melihat akan langit yang ada di atas mereka, bagaimana Kami meninggikannya dan menghiasinya dan langit itu tidak mempunyai retak-retak sedikitpun?"}, {"number": 7, "text": "وَٱلْأَرْضَ مَدَدْنَٰهَا وَأَلْقَيْنَا فِيهَا رَوَٰسِىَ وَأَنۢبَتْنَا فِيهَا مِن كُلِّ زَوْجٍۭ بَهِيجٍ", "translation_en": "And the earth - We spread it out and cast therein firmly set mountains and made grow therein [something] of every beautiful kind,", "translation_id": "Dan Kami hamparkan bumi itu dan Kami letakkan padanya gunung-gunung yang kokoh dan Kami tumbuhkan padanya segala macam tanaman yang indah dipandang mata,"}, {"number": 8, "text": "تَبْصِرَةً وَذِكْرَىٰ لِكُلِّ عَبْدٍ مُّنِيبٍ", "translation_en": "Giving insight and a reminder for every servant who turns [to Allah].", "translation_id": "untuk menjadi pelajaran dan peringatan bagi tiap-tiap hamba yang kembali (mengingat Allah)."}, {"number": 9, "text": "وَنَزَّلْنَا مِنَ ٱلسَّمَآءِ مَآءً مُّبَٰرَكًا فَأَنۢبَتْنَا بِهِۦ جَنَّٰتٍ وَحَبَّ ٱلْحَصِيدِ", "translation_en": "And We have sent down blessed rain from the sky and made grow thereby gardens and grain from the harvest", "translation_id": "Dan Kami turunkan dari langit air yang banyak manfaatnya lalu Kami tumbuhkan dengan air itu pohon-pohon dan biji-biji tanaman yang diketam,"}, {"number": 10, "text": "وَٱلنَّخْلَ بَاسِقَٰتٍ لَّهَا طَلْعٌ نَّضِيدٌ", "translation_en": "And lofty palm trees having fruit arranged in layers -", "translation_id": "dan pohon kurma yang tinggi-tinggi yang mempunyai mayang yang bersusun-susun,"}, {"number": 11, "text": "رِّزْقًا لِّلْعِبَادِ وَأَحْيَيْنَا بِهِۦ بَلْدَةً مَّيْتًا كَذَٰلِكَ ٱلْخُرُوجُ", "translation_en": "As provision for the servants, and We have given life thereby to a dead land. Thus is the resurrection.", "translation_id": "untuk menjadi rezeki bagi hamba-hamba (Kami), dan Kami hidupkan dengan air itu tanah yang mati (kering). Seperti itulah terjadinya kebangkitan."}, {"number": 12, "text": "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَأَصْحَٰبُ ٱلرَّسِّ وَثَمُودُ", "translation_en": "The people of Noah denied before them, and the companions of the well and Thamud", "translation_id": "Sebelum mereka telah mendustakan (pula) kaum Nuh dan penduduk Rass dan Tsamud,"}, {"number": 13, "text": "وَعَادٌ وَفِرْعَوْنُ وَإِخْوَٰنُ لُوطٍ", "translation_en": "And 'Aad and Pharaoh and the brothers of Lot", "translation_id": "dan kaum Aad, kaum Fir'aun dan kaum Luth,"}, {"number": 14, "text": "وَأَصْحَٰبُ ٱلْأَيْكَةِ وَقَوْمُ تُبَّعٍ كُلٌّ كَذَّبَ ٱلرُّسُلَ فَحَقَّ وَعِيدِ", "translation_en": "And the companions of the thicket and the people of Tubba'. All denied the messengers, so My threat was justly fulfilled.", "translation_id": "dan penduduk Aikah serta kaum Tubba' semuanya telah mendustakan rasul-rasul maka sudah semestinyalah mereka mendapat hukuman yang sudah diancamkan."}, {"number": 15, "text": "أَفَعَيِينَا بِٱلْخَلْقِ ٱلْأَوَّلِ بَلْ هُمْ فِى لَبْسٍ مِّنْ خَلْقٍ جَدِيدٍ", "translation_en": "Did We fail in the first creation? But they are in confusion over a new creation.", "translation_id": "Maka apakah Kami letih dengan penciptaan yang pertama? Sebenarnya mereka dalam keadaan ragu-ragu tentang penciptaan yang baru."}, {"number": 16, "text": "وَلَقَدْ خَلَقْنَا ٱلْإِنسَٰنَ وَنَعْلَمُ مَا تُوَسْوِسُ بِهِۦ نَفْسُهُۥ وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ ٱلْوَرِيدِ", "translation_en": "And We have already created man and know what his soul whispers to him, and We are closer to him than [his] jugular vein", "translation_id": "Dan sesungguhnya Kami telah menciptakan manusia dan mengetahui apa yang dibisikkan oleh hatinya, dan Kami lebih dekat kepadanya daripada urat lehernya,"}, {"number": 17, "text": "إِذْ يَتَلَقَّى ٱلْمُتَلَقِّيَانِ عَنِ ٱلْيَمِينِ وَعَنِ ٱلشِّمَالِ قَعِيدٌ", "translation_en": "When the two receivers receive, seated on the right and on the left.", "translation_id": "(yaitu) ketika dua orang malaikat mencatat amal perbuatannya, seorang duduk di sebelah kanan dan yang lain duduk di sebelah kiri."}, {"number": 18, "text": "مَّا يَلْفِظُ مِن قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ", "translation_en": "Man does not utter any word except that with him is an observer prepared [to record].", "translation_id": "Tiada suatu ucapanpun yang diucapkannya melainkan ada di dekatnya malaikat pengawas yang selalu hadir."}, {"number": 19, "text": "وَجَآءَتْ سَكْرَةُ ٱلْمَوْتِ بِٱلْحَقِّ ذَٰلِكَ مَا كُنتَ مِنْهُ تَحِيدُ", "translation_en": "And the intoxication of death will bring the truth; that is what you were trying to avoid.", "translation_id": "Dan datanglah sakaratul maut dengan sebenar-benarnya. Itulah yang kamu selalu lari daripadanya."}, {"number": 20, "text": "وَنُفِخَ فِى ٱلصُّورِ ذَٰلِكَ يَوْمُ ٱلْوَعِيدِ", "translation_en": "And the Horn will be blown. That is the Day of [carrying out] the threat.", "translation_id": "Dan ditiuplah sangkakala. Itulah hari terlaksananya ancaman."}, {"number": 21, "text": "وَجَآءَتْ كُلُّ نَفْسٍ مَّعَهَا سَآئِقٌ وَشَهِيدٌ", "translation_en": "And every soul will come, with it a driver and a witness.", "translation_id": "Dan datanglah tiap-tiap diri, bersama dengan dia seorang malaikat penggiring dan seorang malaikat penyaksi."}, {"number": 22, "text": "لَّقَدْ كُنتَ فِى غَفْلَةٍ مِّنْ هَٰذَا فَكَشَفْنَا عَنكَ غِطَآءَكَ فَبَصَرُكَ ٱلْيَوْمَ حَدِيدٌ", "translation_en": "[It will be said], \"You were certainly in unmindfulness of this, and We have removed from you your cover, so your sight, this Day, is sharp.\"", "translation_id": "Sesungguhnya kamu berada dalam keadaan lalai dari (hal) ini, maka Kami singkapkan daripadamu tutup (yang menutupi) matamu, maka penglihatanmu pada hari itu amat tajam."}, {"number": 23, "text": "وَقَالَ قَرِينُهُۥ هَٰذَا مَا لَدَىَّ عَتِيدٌ", "translation_en": "And his companion, [the angel], will say, \"This [record] is what is with me, prepared.\"", "translation_id": "Dan yang menyertai dia berkata: \"Inilah (catatan amalnya) yang tersedia pada sisiku\"."}, {"number": 24, "text": "أَلْقِيَا فِى جَهَنَّمَ كُلَّ كَفَّارٍ عَنِيدٍ", "translation_en": "[Allah will say], \"Throw into Hell every obstinate disbeliever,", "translation_id": "Allah berfirman: \"Lemparkanlah olehmu berdua ke dalam neraka semua orang yang sangat ingkar dan keras kepala,"}, {"number": 25, "text": "مَّنَّاعٍ لِّلْخَيْرِ مُعْتَدٍ مُّرِيبٍ", "translation_en": "Preventer of good, aggressor, and doubter,", "translation_id": "yang sangat menghalangi kebajikan, melanggar batas lagi ragu-ragu,"}, {"number": 26, "text": "ٱلَّذِى جَعَلَ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَأَلْقِيَاهُ فِى ٱلْعَذَابِ ٱلشَّدِيدِ", "translation_en": "Who made [as equal] with Allah another deity; then throw him into the severe punishment.\"", "translation_id": "yang menyembah sembahan yang lain beserta Allah maka lemparkanlah dia ke dalam siksaan yang sangat\"."}, {"number": 27, "text": "قَالَ قَرِينُهُۥ رَبَّنَا مَآ أَطْغَيْتُهُۥ وَلَٰكِن كَانَ فِى ضَلَٰلٍۭ بَعِيدٍ", "translation_en": "His [devil] companion will say, \"Our Lord, I did not make him transgress, but he [himself] was in extreme error.\"", "translation_id": "Yang menyertai dia berkata (pula): \"Ya Tuhan kami, aku tidak menyesatkannya tetapi dialah yang berada dalam kesesatan yang jauh\"."}, {"number": 28, "text": "قَالَ لَا تَخْتَصِمُوا۟ لَدَىَّ وَقَدْ قَدَّمْتُ إِلَيْكُم بِٱلْوَعِيدِ", "translation_en": "[Allah] will say, \"Do not dispute before Me, while I had already presented to you the warning.", "translation_id": "Allah berfirman: \"Janganlah kamu bertengkar di hadapan-Ku, padahal sesungguhnya Aku dahulu telah memberikan ancaman kepadamu\"."}, {"number": 29, "text": "مَا يُبَدَّلُ ٱلْقَوْلُ لَدَىَّ وَمَآ أَنَا۠ بِظَلَّٰمٍ لِّلْعَبِيدِ", "translation_en": "The word will not be changed with Me, and never will I be unjust to the servants.\"", "translation_id": "Keputusan di sisi-Ku tidak dapat diubah dan Aku sekali-kali tidak menganiaya hamba-hamba-Ku"}, {"number": 30, "text": "يَوْمَ نَقُولُ لِجَهَنَّمَ هَلِ ٱمْتَلَأْتِ وَتَقُولُ هَلْ مِن مَّزِيدٍ", "translation_en": "On the Day We will say to Hell, \"Have you been filled?\" and it will say, \"Are there some more,\"", "translation_id": "(Dan ingatlah akan) hari (yang pada hari itu) Kami bertanya kepada jahannam: \"Apakah kamu sudah penuh?\" Dia menjawab: \"Masih ada tambahan?\""}, {"number": 31, "text": "وَأُزْلِفَتِ ٱلْجَنَّةُ لِلْمُتَّقِينَ غَيْرَ بَعِيدٍ", "translation_en": "And Paradise will be brought near to the righteous, not far,", "translation_id": "Dan didekatkanlah surga itu kepada orang-orang yang bertakwa pada tempat yang tiada jauh (dari mereka)."}, {"number": 32, "text": "هَٰذَا مَا تُوعَدُونَ لِكُلِّ أَوَّابٍ حَفِيظٍ", "translation_en": "[It will be said], \"This is what you were promised - for every returner [to Allah] and keeper [of His covenant]", "translation_id": "Inilah yang dijanjikan kepadamu, (yaitu) kepada setiap hamba yang selalu kembali (kepada Allah) lagi memelihara (semua peraturan-peraturan-Nya)"}, {"number": 33, "text": "مَّنْ خَشِىَ ٱلرَّحْمَٰنَ بِٱلْغَيْبِ وَجَآءَ بِقَلْبٍ مُّنِيبٍ", "translation_en": "Who feared the Most Merciful unseen and came with a heart returning [in repentance].", "translation_id": "(Yaitu) orang yang takut kepada Tuhan Yang Maha Pemurah sedang Dia tidak kelihatan (olehnya) dan dia datang dengan hati yang bertaubat,"}, {"number": 34, "text": "ٱدْخُلُوهَا بِسَلَٰمٍ ذَٰلِكَ يَوْمُ ٱلْخُلُودِ", "translation_en": "Enter it in peace. This is the Day of Eternity.\"", "translation_id": "masukilah surga itu dengan aman, itulah hari kekekalan."}, {"number": 35, "text": "لَهُم مَّا يَشَآءُونَ فِيهَا وَلَدَيْنَا مَزِيدٌ", "translation_en": "They will have whatever they wish therein, and with Us is more.", "translation_id": "Mereka di dalamnya memperoleh apa yang mereka kehendaki; dan pada sisi Kami ada tambahannya."}, {"number": 36, "text": "وَكَمْ أَهْلَكْنَا قَبْلَهُم مِّن قَرْنٍ هُمْ أَشَدُّ مِنْهُم بَطْشًا فَنَقَّبُوا۟ فِى ٱلْبِلَٰدِ هَلْ مِن مَّحِيصٍ", "translation_en": "And how many a generation before them did We destroy who were greater than them in [striking] power and had explored throughout the lands. Is there any place of escape?", "translation_id": "Dan berapa banyaknya umat-umat yang telah Kami binasakan sebelum mereka yang mereka itu lebih besar kekuatannya daripada mereka ini, maka mereka (yang telah dibinasakan itu) telah pernah menjelajah di beberapa negeri. Adakah (mereka) mendapat tempat lari (dari kebinasaan)?"}, {"number": 37, "text": "إِنَّ فِى ذَٰلِكَ لَذِكْرَىٰ لِمَن كَانَ لَهُۥ قَلْبٌ أَوْ أَلْقَى ٱلسَّمْعَ وَهُوَ شَهِيدٌ", "translation_en": "Indeed in that is a reminder for whoever has a heart or who listens while he is present [in mind].", "translation_id": "Sesungguhnya pada yang demikian itu benar-benar terdapat peringatan bagi orang-orang yang mempunyai akal atau yang menggunakan pendengarannya, sedang dia menyaksikannya."}, {"number": 38, "text": "وَلَقَدْ خَلَقْنَا ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ وَمَا بَيْنَهُمَا فِى سِتَّةِ أَيَّامٍ وَمَا مَسَّنَا مِن لُّغُوبٍ", "translation_en": "And We did certainly create the heavens and earth and what is between them in six days, and there touched Us no weariness.", "translation_id": "Dan sesungguhnya telah Kami ciptakan langit dan bumi dan apa yang ada antara keduanya dalam enam masa, dan Kami sedikitpun tidak ditimpa keletihan."}, {"number": 39, "text": "فَٱصْبِرْ عَلَىٰ مَا يَقُولُونَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ ٱلشَّمْسِ وَقَبْلَ ٱلْغُرُوبِ", "translation_en": "So be patient, [O Muhammad], over what they say and exalt [Allah] with praise of your Lord before the rising of the sun and before its setting,", "translation_id": "Maka bersabarlah kamu terhadap apa yang mereka katakan dan bertasbihlah sambil memuji Tuhanmu sebelum terbit matahari dan sebelum terbenam(nya)."}, {"number": 40, "text": "وَمِنَ ٱلَّيْلِ فَسَبِّحْهُ وَأَدْبَٰرَ ٱلسُّجُودِ", "translation_en": "And [in part] of the night exalt Him and after prostration.", "translation_id": "Dan bertasbihlah kamu kepada-Nya di malam hari dan setiap selesai sembahyang."}, {"number": 41, "text": "وَٱسْتَمِعْ يَوْمَ يُنَادِ ٱلْمُنَادِ مِن مَّكَانٍ قَرِيبٍ", "translation_en": "And listen on the Day when the Caller will call out from a place that is near -", "translation_id": "Dan dengarkanlah (seruan) pada hari penyeru (malaikat) menyeru dari tempat yang dekat."}, {"number": 42, "text": "يَوْمَ يَسْمَعُونَ ٱلصَّيْحَةَ بِٱلْحَقِّ ذَٰلِكَ يَوْمُ ٱلْخُرُوجِ", "translation_en": "The Day they will hear the blast [of the Horn] in truth. That is the Day of Emergence [from the graves].", "translation_id": "(Yaitu) pada hari mereka mendengar teriakan dengan sebenar-benarnya itulah hari ke luar (dari kubur)."}, {"number": 43, "text": "إِنَّا نَحْنُ نُحْىِۦ وَنُمِيتُ وَإِلَيْنَا ٱلْمَصِيرُ", "translation_en": "Indeed, it is We who give life and cause death, and to Us is the destination", "translation_id": "Sesungguhnya Kami menghidupkan dan mematikan dan hanya kepada Kami-lah tempat kembali (semua makhluk)."}, {"number": 44, "text": "يَوْمَ تَشَقَّقُ ٱلْأَرْضُ عَنْهُمْ سِرَاعًا ذَٰلِكَ حَشْرٌ عَلَيْنَا يَسِيرٌ", "translation_en": "On the Day the earth breaks away from them [and they emerge] rapidly; that is a gathering easy for Us.", "translation_id": "(Yaitu) pada hari bumi terbelah-belah menampakkan mereka (lalu mereka ke luar) dengan cepat. Yang demikian itu adalah pengumpulan yang mudah bagi Kami."}, {"number": 45, "text": "نَّحْنُ أَعْلَمُ بِمَا يَقُولُونَ وَمَآ أَنتَ عَلَيْهِم بِجَبَّارٍ فَذَكِّرْ بِٱلْقُرْءَانِ مَن يَخَافُ وَعِيدِ", "translation_en": "We are most knowing of what they say, and you are not over them a tyrant. But remind by the Qur'an whoever fears My threat.", "translation_id": "Kami lebih mengetahui tentang apa yang mereka katakan, dan kamu sekali-kali bukanlah seorang pemaksa terhadap mereka. Maka beri peringatanlah dengan Al Quran orang yang takut dengan ancaman-Ku."}]}