{"number": 76, "name": "سورة الانسان", "transliteration_en": "Al-Insaan", "translation_en": "Man", "total_verses": 31, "revelation_type": "Medinan", "verses": [{"number": 1, "text": " هَلْ أَتَىٰ عَلَى ٱلْإِنسَٰنِ حِينٌ مِّنَ ٱلدَّهْرِ لَمْ يَكُن شَيْـًٔا مَّذْكُورًا", "translation_en": "Has there [not] come upon man a period of time when he was not a thing [even] mentioned?", "translation_id": "Bukankah telah datang atas manusia satu waktu dari masa, sedang dia ketika itu belum merupakan sesuatu yang dapat disebut?"}, {"number": 2, "text": "إِنَّا خَلَقْنَا ٱلْإِنسَٰنَ مِن نُّطْفَةٍ أَمْشَاجٍ نَّبْتَلِيهِ فَجَعَلْنَٰهُ سَمِيعًۢا بَصِيرًا", "translation_en": "Indeed, We created man from a sperm-drop mixture that We may try him; and We made him hearing and seeing.", "translation_id": "Sesungguhnya Kami telah menciptakan manusia dari setetes mani yang bercampur yang Kami hendak mengujinya (dengan perintah dan larangan), karena itu Kami jadikan dia mendengar dan melihat."}, {"number": 3, "text": "إِنَّا هَدَيْنَٰهُ ٱلسَّبِيلَ إِمَّا شَاكِرًا وَإِمَّا كَفُورًا", "translation_en": "Indeed, We guided him to the way, be he grateful or be he ungrateful.", "translation_id": "Sesungguhnya Kami telah menunjukinya jalan yang lurus; ada yang bersyukur dan ada pula yang kafir."}, {"number": 4, "text": "إِنَّآ أَعْتَدْنَا لِلْكَٰفِرِينَ سَلَٰسِلَا۟ وَأَغْلَٰلًا وَسَعِيرًا", "translation_en": "Indeed, We have prepared for the disbelievers chains and shackles and a blaze.", "translation_id": "Sesungguhnya Kami menyediakan bagi orang-orang kafir rantai, belenggu dan neraka yang menyala-nyala."}, {"number": 5, "text": "إِنَّ ٱلْأَبْرَارَ يَشْرَبُونَ مِن كَأْسٍ كَانَ مِزَاجُهَا كَافُورًا", "translation_en": "Indeed, the righteous will drink from a cup [of wine] whose mixture is of Kafur,", "translation_id": "Sesungguhnya orang-orang yang berbuat kebajikan minum dari gelas (berisi minuman) yang campurannya adalah air kafur,"}, {"number": 6, "text": "عَيْنًا يَشْرَبُ بِهَا عِبَادُ ٱللَّهِ يُفَجِّرُونَهَا تَفْجِيرًا", "translation_en": "A spring of which the [righteous] servants of Allah will drink; they will make it gush forth in force [and abundance].", "translation_id": "(yaitu) mata air (dalam surga) yang daripadanya hamba-hamba Allah minum, yang mereka dapat mengalirkannya dengan sebaik-baiknya."}, {"number": 7, "text": "يُوفُونَ بِٱلنَّذْرِ وَيَخَافُونَ يَوْمًا كَانَ شَرُّهُۥ مُسْتَطِيرًا", "translation_en": "They [are those who] fulfill [their] vows and fear a Day whose evil will be widespread.", "translation_id": "Mereka menunaikan nazar dan takut akan suatu hari yang azabnya merata di mana-mana."}, {"number": 8, "text": "وَيُطْعِمُونَ ٱلطَّعَامَ عَلَىٰ حُبِّهِۦ مِسْكِينًا وَيَتِيمًا وَأَسِيرًا", "translation_en": "And they give food in spite of love for it to the needy, the orphan, and the captive,", "translation_id": "Dan mereka memberikan makanan yang disukainya kepada orang miskin, anak yatim dan orang yang ditawan."}, {"number": 9, "text": "إِنَّمَا نُطْعِمُكُمْ لِوَجْهِ ٱللَّهِ لَا نُرِيدُ مِنكُمْ جَزَآءً وَلَا شُكُورًا", "translation_en": "[Saying], \"We feed you only for the countenance of Allah. We wish not from you reward or gratitude.", "translation_id": "Sesungguhnya kami memberi makanan kepadamu hanyalah untuk mengharapkan keridhaan Allah, kami tidak menghendaki balasan dari kamu dan tidak pula (ucapan) terima kasih."}, {"number": 10, "text": "إِنَّا نَخَافُ مِن رَّبِّنَا يَوْمًا عَبُوسًا قَمْطَرِيرًا", "translation_en": "Indeed, We fear from our Lord a Day austere and distressful.\"", "translation_id": "Sesungguhnya kami takut akan (azab) Tuhan kami pada suatu hari yang (di hari itu) orang-orang bermuka masam penuh kesulitan."}, {"number": 11, "text": "فَوَقَىٰهُمُ ٱللَّهُ شَرَّ ذَٰلِكَ ٱلْيَوْمِ وَلَقَّىٰهُمْ نَضْرَةً وَسُرُورًا", "translation_en": "So Allah will protect them from the evil of that Day and give them radiance and happiness", "translation_id": "Maka Tuhan memelihara mereka dari kesusahan hari itu, dan memberikan kepada mereka kejernihan (wajah) dan kegembiraan hati."}, {"number": 12, "text": "وَجَزَىٰهُم بِمَا صَبَرُوا۟ جَنَّةً وَحَرِيرًا", "translation_en": "And will reward them for what they patiently endured [with] a garden [in Paradise] and silk [garments].", "translation_id": "Dan Dia memberi balasan kepada mereka karena kesabaran mereka (dengan) surga dan (pakaian) sutera,"}, {"number": 13, "text": "مُّتَّكِـِٔينَ فِيهَا عَلَى ٱلْأَرَآئِكِ لَا يَرَوْنَ فِيهَا شَمْسًا وَلَا زَمْهَرِيرًا", "translation_en": "[They will be] reclining therein on adorned couches. They will not see therein any [burning] sun or [freezing] cold.", "translation_id": "di dalamnya mereka duduk bertelakan di atas dipan, mereka tidak merasakan di dalamnya (teriknya) matahari dan tidak pula dingin yang bersangatan."}, {"number": 14, "text": "وَدَانِيَةً عَلَيْهِمْ ظِلَٰلُهَا وَذُلِّلَتْ قُطُوفُهَا تَذْلِيلًا", "translation_en": "And near above them are its shades, and its [fruit] to be picked will be lowered in compliance.", "translation_id": "Dan naungan (pohon-pohon surga itu) dekat di atas mereka dan buahnya dimudahkan memetiknya semudah-mudahnya."}, {"number": 15, "text": "وَيُطَافُ عَلَيْهِم بِـَٔانِيَةٍ مِّن فِضَّةٍ وَأَكْوَابٍ كَانَتْ قَوَارِيرَا۠", "translation_en": "And there will be circulated among them vessels of silver and cups having been [created] clear [as glass],", "translation_id": "Dan diedarkan kepada mereka bejana-bejana dari perak dan piala-piala yang bening laksana kaca,"}, {"number": 16, "text": "قَوَارِيرَا۟ مِن فِضَّةٍ قَدَّرُوهَا تَقْدِيرًا", "translation_en": "Clear glasses [made] from silver of which they have determined the measure.", "translation_id": "(yaitu) kaca-kaca (yang terbuat) dari perak yang telah diukur mereka dengan sebaik-baiknya."}, {"number": 17, "text": "وَيُسْقَوْنَ فِيهَا كَأْسًا كَانَ مِزَاجُهَا زَنجَبِيلًا", "translation_en": "And they will be given to drink a cup [of wine] whose mixture is of ginger", "translation_id": "Di dalam surga itu mereka diberi minum segelas (minuman) yang campurannya adalah jahe."}, {"number": 18, "text": "عَيْنًا فِيهَا تُسَمَّىٰ سَلْسَبِيلًا", "translation_en": "[From] a fountain within Paradise named Salsabeel.", "translation_id": "(Yang didatangkan dari) sebuah mata air surga yang dinamakan salsabil."}, {"number": 19, "text": "وَيَطُوفُ عَلَيْهِمْ وِلْدَٰنٌ مُّخَلَّدُونَ إِذَا رَأَيْتَهُمْ حَسِبْتَهُمْ لُؤْلُؤًا مَّنثُورًا", "translation_en": "There will circulate among them young boys made eternal. When you see them, you would think them [as beautiful as] scattered pearls.", "translation_id": "Dan mereka dikelilingi oleh pelayan-pelayan muda yang tetap muda. Apabila kamu melihat mereka, kamu akan mengira mereka, mutiara yang bertaburan."}, {"number": 20, "text": "وَإِذَا رَأَيْتَ ثَمَّ رَأَيْتَ نَعِيمًا وَمُلْكًا كَبِيرًا", "translation_en": "And when you look there [in Paradise], you will see pleasure and great dominion.", "translation_id": "Dan apabila kamu melihat di sana (surga), niscaya kamu akan melihat berbagai macam kenikmatan dan kerajaan yang besar."}, {"number": 21, "text": "عَٰلِيَهُمْ ثِيَابُ سُندُسٍ خُضْرٌ وَإِسْتَبْرَقٌ وَحُلُّوٓا۟ أَسَاوِرَ مِن فِضَّةٍ وَسَقَىٰهُمْ رَبُّهُمْ شَرَابًا طَهُورًا", "translation_en": "Upon the inhabitants will be green garments of fine silk and brocade. And they will be adorned with bracelets of silver, and their Lord will give them a purifying drink.", "translation_id": "Mereka memakai pakaian sutera halus yang hijau dan sutera tebal dan dipakaikan kepada mereka gelang terbuat dari perak, dan Tuhan memberikan kepada mereka minuman yang bersih."}, {"number": 22, "text": "إِنَّ هَٰذَا كَانَ لَكُمْ جَزَآءً وَكَانَ سَعْيُكُم مَّشْكُورًا", "translation_en": "[And it will be said], \"Indeed, this is for you a reward, and your effort has been appreciated.\"", "translation_id": "Sesungguhnya ini adalah balasan untukmu, dan usahamu adalah disyukuri (diberi balasan)."}, {"number": 23, "text": "إِنَّا نَحْنُ نَزَّلْنَا عَلَيْكَ ٱلْقُرْءَانَ تَنزِيلًا", "translation_en": "Indeed, it is We who have sent down to you, [O Muhammad], the Qur'an progressively.", "translation_id": "Sesungguhnya Kami telah menurunkan Al Quran kepadamu (hai Muhammad) dengan berangsur-angsur."}, {"number": 24, "text": "فَٱصْبِرْ لِحُكْمِ رَبِّكَ وَلَا تُطِعْ مِنْهُمْ ءَاثِمًا أَوْ كَفُورًا", "translation_en": "So be patient for the decision of your Lord and do not obey from among them a sinner or ungrateful [disbeliever].", "translation_id": "Maka bersabarlah kamu untuk (melaksanakan) ketetapan Tuhanmu, dan janganlah kamu ikuti orang yang berdosa dan orang yang kafir di antar mereka."}, {"number": 25, "text": "وَٱذْكُرِ ٱسْمَ رَبِّكَ بُكْرَةً وَأَصِيلًا", "translation_en": "And mention the name of your Lord [in prayer] morning and evening", "translation_id": "Dan sebutlah nama Tuhanmu pada (waktu) pagi dan petang."}, {"number": 26, "text": "وَمِنَ ٱلَّيْلِ فَٱسْجُدْ لَهُۥ وَسَبِّحْهُ لَيْلًا طَوِيلًا", "translation_en": "And during the night prostrate to Him and exalt Him a long [part of the] night.", "translation_id": "Dan pada sebagian dari malam, maka sujudlah kepada-Nya dan bertasbihlah kepada-Nya pada bagian yang panjang dimalam hari."}, {"number": 27, "text": "إِنَّ هَٰٓؤُلَآءِ يُحِبُّونَ ٱلْعَاجِلَةَ وَيَذَرُونَ وَرَآءَهُمْ يَوْمًا ثَقِيلًا", "translation_en": "Indeed, these [disbelievers] love the immediate and leave behind them a grave Day.", "translation_id": "Sesungguhnya mereka (orang kafir) menyukai kehidupan dunia dan mereka tidak memperdulikan kesudahan mereka, pada hari yang berat (hari akhirat)."}, {"number": 28, "text": "نَّحْنُ خَلَقْنَٰهُمْ وَشَدَدْنَآ أَسْرَهُمْ وَإِذَا شِئْنَا بَدَّلْنَآ أَمْثَٰلَهُمْ تَبْدِيلًا", "translation_en": "We have created them and strengthened their forms, and when We will, We can change their likenesses with [complete] alteration.", "translation_id": "Kami telah menciptakan mereka dan menguatkan persendian tubuh mereka, apabila Kami menghendaki, Kami sungguh-sungguh mengganti (mereka) dengan orang-orang yang serupa dengan mereka."}, {"number": 29, "text": "إِنَّ هَٰذِهِۦ تَذْكِرَةٌ فَمَن شَآءَ ٱتَّخَذَ إِلَىٰ رَبِّهِۦ سَبِيلًا", "translation_en": "Indeed, this is a reminder, so he who wills may take to his Lord a way.", "translation_id": "Sesungguhnya (ayat-ayat) ini adalah suatu peringatan, maka barangsiapa menghendaki (kebaikan bagi dirinya) niscaya dia mengambil jalan kepada Tuhannya."}, {"number": 30, "text": "وَمَا تَشَآءُونَ إِلَّآ أَن يَشَآءَ ٱللَّهُ إِنَّ ٱللَّهَ كَانَ عَلِيمًا حَكِيمًا", "translation_en": "And you do not will except that Allah wills. Indeed, Allah is ever Knowing and Wise.", "translation_id": "Dan kamu tidak mampu (menempuh jalan itu), kecuali bila dikehendaki Allah. Sesungguhnya Allah adalah Maha Mengetahui lagi Maha Bijaksana."}, {"number": 31, "text": "يُدْخِلُ مَن يَشَآءُ فِى رَحْمَتِهِۦ وَٱلظَّٰلِمِينَ أَعَدَّ لَهُمْ عَذَابًا أَلِيمًۢا", "translation_en": "He admits whom He wills into His mercy; but the wrongdoers - He has prepared for them a painful punishment.", "translation_id": "Dan memasukkan siapa yang dikehendaki-Nya ke dalam rahmat-Nya (surga). Dan bagi orang-orang zalim disediakan-Nya azab yang pedih."}]}