{"number": 69, "name": "سورة الحاقة", "transliteration_en": "Al-Haaqqa", "translation_en": "The Reality", "total_verses": 52, "revelation_type": "Meccan", "verses": [{"number": 1, "text": " ٱلْحَآقَّةُ", "translation_en": "The Inevitable Reality -", "translation_id": "Hari kiamat,"}, {"number": 2, "text": "مَا ٱلْحَآقَّةُ", "translation_en": "What is the Inevitable Reality?", "translation_id": "apakah hari kiamat itu?"}, {"number": 3, "text": "وَمَآ أَدْرَىٰكَ مَا ٱلْحَآقَّةُ", "translation_en": "And what can make you know what is the Inevitable Reality?", "translation_id": "Dan tahukah kamu apakah hari kiamat itu?"}, {"number": 4, "text": "كَذَّبَتْ ثَمُودُ وَعَادٌۢ بِٱلْقَارِعَةِ", "translation_en": "Thamud and 'Aad denied the Striking Calamity.", "translation_id": "Kaum Tsamud dan 'Aad telah mendustakan hari kiamat."}, {"number": 5, "text": "فَأَمَّا ثَمُودُ فَأُهْلِكُوا۟ بِٱلطَّاغِيَةِ", "translation_en": "So as for Thamud, they were destroyed by the overpowering [blast].", "translation_id": "Adapun kaum Tsamud, maka mereka telah dibinasakan dengan kejadian yang luar biasa."}, {"number": 6, "text": "وَأَمَّا عَادٌ فَأُهْلِكُوا۟ بِرِيحٍ صَرْصَرٍ عَاتِيَةٍ", "translation_en": "And as for 'Aad, they were destroyed by a screaming, violent wind", "translation_id": "Adapun kaum 'Aad maka mereka telah dibinasakan dengan angin yang sangat dingin lagi amat kencang,"}, {"number": 7, "text": "سَخَّرَهَا عَلَيْهِمْ سَبْعَ لَيَالٍ وَثَمَٰنِيَةَ أَيَّامٍ حُسُومًا فَتَرَى ٱلْقَوْمَ فِيهَا صَرْعَىٰ كَأَنَّهُمْ أَعْجَازُ نَخْلٍ خَاوِيَةٍ", "translation_en": "Which Allah imposed upon them for seven nights and eight days in succession, so you would see the people therein fallen as if they were hollow trunks of palm trees.", "translation_id": "yang Allah menimpakan angin itu kepada mereka selama tujuh malam dan delapan hari terus menerus; maka kamu lihat kaum 'Aad pada waktu itu mati bergelimpangan seakan-akan mereka tunggul pohon kurma yang telah kosong (lapuk)."}, {"number": 8, "text": "فَهَلْ تَرَىٰ لَهُم مِّنۢ بَاقِيَةٍ", "translation_en": "Then do you see of them any remains?", "translation_id": "Maka kamu tidak melihat seorangpun yang tinggal di antara mereka."}, {"number": 9, "text": "وَجَآءَ فِرْعَوْنُ وَمَن قَبْلَهُۥ وَٱلْمُؤْتَفِكَٰتُ بِٱلْخَاطِئَةِ", "translation_en": "And there came Pharaoh and those before him and the overturned cities with sin.", "translation_id": "Dan telah datang Fir'aun dan orang-orang yang sebelumnya dan (penduduk) negeri-negeri yang dijungkir balikkan karena kesalahan yang besar."}, {"number": 10, "text": "فَعَصَوْا۟ رَسُولَ رَبِّهِمْ فَأَخَذَهُمْ أَخْذَةً رَّابِيَةً", "translation_en": "And they disobeyed the messenger of their Lord, so He seized them with a seizure exceeding [in severity].", "translation_id": "Maka (masing-masing) mereka mendurhakai rasul Tuhan mereka, lalu Allah menyiksa mereka dengan siksaan yang sangat keras."}, {"number": 11, "text": "إِنَّا لَمَّا طَغَا ٱلْمَآءُ حَمَلْنَٰكُمْ فِى ٱلْجَارِيَةِ", "translation_en": "Indeed, when the water overflowed, We carried your ancestors in the sailing ship", "translation_id": "Sesungguhnya Kami, tatkala air telah naik (sampai ke gunung) Kami bawa (nenek moyang) kamu, ke dalam bahtera,"}, {"number": 12, "text": "لِنَجْعَلَهَا لَكُمْ تَذْكِرَةً وَتَعِيَهَآ أُذُنٌ وَٰعِيَةٌ", "translation_en": "That We might make it for you a reminder and [that] a conscious ear would be conscious of it.", "translation_id": "agar Kami jadikan peristiwa itu peringatan bagi kamu dan agar diperhatikan oleh telinga yang mau mendengar."}, {"number": 13, "text": "فَإِذَا نُفِخَ فِى ٱلصُّورِ نَفْخَةٌ وَٰحِدَةٌ", "translation_en": "Then when the Horn is blown with one blast", "translation_id": "Maka apabila sangkakala ditiup sekali tiup"}, {"number": 14, "text": "وَحُمِلَتِ ٱلْأَرْضُ وَٱلْجِبَالُ فَدُكَّتَا دَكَّةً وَٰحِدَةً", "translation_en": "And the earth and the mountains are lifted and leveled with one blow -", "translation_id": "dan diangkatlah bumi dan gunung-gunung, lalu dibenturkan keduanya sekali bentur."}, {"number": 15, "text": "فَيَوْمَئِذٍ وَقَعَتِ ٱلْوَاقِعَةُ", "translation_en": "Then on that Day, the Resurrection will occur,", "translation_id": "Maka pada hari itu terjadilah hari kiamat,"}, {"number": 16, "text": "وَٱنشَقَّتِ ٱلسَّمَآءُ فَهِىَ يَوْمَئِذٍ وَاهِيَةٌ", "translation_en": "And the heaven will split [open], for that Day it is infirm.", "translation_id": "dan terbelahlah langit, karena pada hari itu langit menjadi lemah."}, {"number": 17, "text": "وَٱلْمَلَكُ عَلَىٰٓ أَرْجَآئِهَا وَيَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَئِذٍ ثَمَٰنِيَةٌ", "translation_en": "And the angels are at its edges. And there will bear the Throne of your Lord above them, that Day, eight [of them].", "translation_id": "Dan malaikat-malaikat berada di penjuru-penjuru langit. Dan pada hari itu delapan orang malaikat menjunjung 'Arsy Tuhanmu di atas (kepala) mereka."}, {"number": 18, "text": "يَوْمَئِذٍ تُعْرَضُونَ لَا تَخْفَىٰ مِنكُمْ خَافِيَةٌ", "translation_en": "That Day, you will be exhibited [for judgement]; not hidden among you is anything concealed.", "translation_id": "Pada hari itu kamu dihadapkan (kepada Tuhanmu), tiada sesuatupun dari keadaanmu yang tersembunyi (bagi Allah)."}, {"number": 19, "text": "فَأَمَّا مَنْ أُوتِىَ كِتَٰبَهُۥ بِيَمِينِهِۦ فَيَقُولُ هَآؤُمُ ٱقْرَءُوا۟ كِتَٰبِيَهْ", "translation_en": "So as for he who is given his record in his right hand, he will say, \"Here, read my record!", "translation_id": "Adapun orang-orang yang diberikan kepadanya kitabnya dari sebelah kanannya, maka dia berkata: \"Ambillah, bacalah kitabku (ini)\"."}, {"number": 20, "text": "إِنِّى ظَنَنتُ أَنِّى مُلَٰقٍ حِسَابِيَهْ", "translation_en": "Indeed, I was certain that I would be meeting my account.\"", "translation_id": "Sesungguhnya aku yakin, bahwa sesungguhnya aku akan menemui hisab terhadap diriku."}, {"number": 21, "text": "فَهُوَ فِى عِيشَةٍ رَّاضِيَةٍ", "translation_en": "So he will be in a pleasant life -", "translation_id": "Maka orang itu berada dalam kehidupan yang diridhai,"}, {"number": 22, "text": "فِى جَنَّةٍ عَالِيَةٍ", "translation_en": "In an elevated garden,", "translation_id": "dalam surga yang tinggi,"}, {"number": 23, "text": "قُطُوفُهَا دَانِيَةٌ", "translation_en": "Its [fruit] to be picked hanging near.", "translation_id": "buah-buahannya dekat,"}, {"number": 24, "text": "كُلُوا۟ وَٱشْرَبُوا۟ هَنِيٓـًٔۢا بِمَآ أَسْلَفْتُمْ فِى ٱلْأَيَّامِ ٱلْخَالِيَةِ", "translation_en": "[They will be told], \"Eat and drink in satisfaction for what you put forth in the days past.\"", "translation_id": "(kepada mereka dikatakan): \"Makan dan minumlah dengan sedap disebabkan amal yang telah kamu kerjakan pada hari-hari yang telah lalu\"."}, {"number": 25, "text": "وَأَمَّا مَنْ أُوتِىَ كِتَٰبَهُۥ بِشِمَالِهِۦ فَيَقُولُ يَٰلَيْتَنِى لَمْ أُوتَ كِتَٰبِيَهْ", "translation_en": "But as for he who is given his record in his left hand, he will say, \"Oh, I wish I had not been given my record", "translation_id": "Adapun orang yang diberikan kepadanya kitabnya dari sebelah kirinya, maka dia berkata: \"Wahai alangkah baiknya kiranya tidak diberikan kepadaku kitabku (ini)."}, {"number": 26, "text": "وَلَمْ أَدْرِ مَا حِسَابِيَهْ", "translation_en": "And had not known what is my account.", "translation_id": "Dan aku tidak mengetahui apa hisab terhadap diriku."}, {"number": 27, "text": "يَٰلَيْتَهَا كَانَتِ ٱلْقَاضِيَةَ", "translation_en": "I wish my death had been the decisive one.", "translation_id": "Wahai kiranya kematian itulah yang menyelesaikan segala sesuatu."}, {"number": 28, "text": "مَآ أَغْنَىٰ عَنِّى مَالِيَهْ", "translation_en": "My wealth has not availed me.", "translation_id": "Hartaku sekali-kali tidak memberi manfaat kepadaku."}, {"number": 29, "text": "هَلَكَ عَنِّى سُلْطَٰنِيَهْ", "translation_en": "Gone from me is my authority.\"", "translation_id": "Telah hilang kekuasaanku daripadaku\"."}, {"number": 30, "text": "خُذُوهُ فَغُلُّوهُ", "translation_en": "[Allah will say], \"Seize him and shackle him.", "translation_id": "(Allah berfirman): \"Peganglah dia lalu belenggulah tangannya ke lehernya."}, {"number": 31, "text": "ثُمَّ ٱلْجَحِيمَ صَلُّوهُ", "translation_en": "Then into Hellfire drive him.", "translation_id": "Kemudian masukkanlah dia ke dalam api neraka yang menyala-nyala."}, {"number": 32, "text": "ثُمَّ فِى سِلْسِلَةٍ ذَرْعُهَا سَبْعُونَ ذِرَاعًا فَٱسْلُكُوهُ", "translation_en": "Then into a chain whose length is seventy cubits insert him.\"", "translation_id": "Kemudian belitlah dia dengan rantai yang panjangnya tujuh puluh hasta."}, {"number": 33, "text": "إِنَّهُۥ كَانَ لَا يُؤْمِنُ بِٱللَّهِ ٱلْعَظِيمِ", "translation_en": "Indeed, he did not used to believe in Allah, the Most Great,", "translation_id": "Sesungguhnya dia dahulu tidak beriman kepada Allah Yang Maha Besar."}, {"number": 34, "text": "وَلَا يَحُضُّ عَلَىٰ طَعَامِ ٱلْمِسْكِينِ", "translation_en": "Nor did he encourage the feeding of the poor.", "translation_id": "Dan juga dia tidak mendorong (orang lain) untuk memberi makan orang miskin."}, {"number": 35, "text": "فَلَيْسَ لَهُ ٱلْيَوْمَ هَٰهُنَا حَمِيمٌ", "translation_en": "So there is not for him here this Day any devoted friend", "translation_id": "Maka tiada seorang temanpun baginya pada hari ini di sini."}, {"number": 36, "text": "وَلَا طَعَامٌ إِلَّا مِنْ غِسْلِينٍ", "translation_en": "Nor any food except from the discharge of wounds;", "translation_id": "Dan tiada (pula) makanan sedikitpun (baginya) kecuali dari darah dan nanah."}, {"number": 37, "text": "لَّا يَأْكُلُهُۥٓ إِلَّا ٱلْخَٰطِـُٔونَ", "translation_en": "None will eat it except the sinners.", "translation_id": "Tidak ada yang memakannya kecuali orang-orang yang berdosa."}, {"number": 38, "text": "فَلَآ أُقْسِمُ بِمَا تُبْصِرُونَ", "translation_en": "So I swear by what you see", "translation_id": "Maka Aku bersumpah dengan apa yang kamu lihat."}, {"number": 39, "text": "وَمَا لَا تُبْصِرُونَ", "translation_en": "And what you do not see", "translation_id": "Dan dengan apa yang tidak kamu lihat."}, {"number": 40, "text": "إِنَّهُۥ لَقَوْلُ رَسُولٍ كَرِيمٍ", "translation_en": "[That] indeed, the Qur'an is the word of a noble Messenger.", "translation_id": "Sesungguhnya Al Quran itu adalah benar-benar wahyu (Allah yang diturunkan kepada) Rasul yang mulia,"}, {"number": 41, "text": "وَمَا هُوَ بِقَوْلِ شَاعِرٍ قَلِيلًا مَّا تُؤْمِنُونَ", "translation_en": "And it is not the word of a poet; little do you believe.", "translation_id": "dan Al Quran itu bukanlah perkataan seorang penyair. Sedikit sekali kamu beriman kepadanya."}, {"number": 42, "text": "وَلَا بِقَوْلِ كَاهِنٍ قَلِيلًا مَّا تَذَكَّرُونَ", "translation_en": "Nor the word of a soothsayer; little do you remember.", "translation_id": "Dan bukan pula perkataan tukang tenung. Sedikit sekali kamu mengambil pelajaran daripadanya."}, {"number": 43, "text": "تَنزِيلٌ مِّن رَّبِّ ٱلْعَٰلَمِينَ", "translation_en": "[It is] a revelation from the Lord of the worlds.", "translation_id": "Ia adalah wahyu yang diturunkan dari Tuhan semesta alam."}, {"number": 44, "text": "وَلَوْ تَقَوَّلَ عَلَيْنَا بَعْضَ ٱلْأَقَاوِيلِ", "translation_en": "And if Muhammad had made up about Us some [false] sayings,", "translation_id": "Seandainya dia (Muhammad) mengadakan sebagian perkataan atas (nama) Kami,"}, {"number": 45, "text": "لَأَخَذْنَا مِنْهُ بِٱلْيَمِينِ", "translation_en": "We would have seized him by the right hand;", "translation_id": "niscaya benar-benar Kami pegang dia pada tangan kanannya."}, {"number": 46, "text": "ثُمَّ لَقَطَعْنَا مِنْهُ ٱلْوَتِينَ", "translation_en": "Then We would have cut from him the aorta.", "translation_id": "Kemudian benar-benar Kami potong urat tali jantungnya."}, {"number": 47, "text": "فَمَا مِنكُم مِّنْ أَحَدٍ عَنْهُ حَٰجِزِينَ", "translation_en": "And there is no one of you who could prevent [Us] from him.", "translation_id": "Maka sekali-kali tidak ada seorangpun dari kamu yang dapat menghalangi (Kami), dari pemotongan urat nadi itu."}, {"number": 48, "text": "وَإِنَّهُۥ لَتَذْكِرَةٌ لِّلْمُتَّقِينَ", "translation_en": "And indeed, the Qur'an is a reminder for the righteous.", "translation_id": "Dan sesungguhnya Al Quran itu benar-benar suatu pelajaran bagi orang-orang yang bertakwa."}, {"number": 49, "text": "وَإِنَّا لَنَعْلَمُ أَنَّ مِنكُم مُّكَذِّبِينَ", "translation_en": "And indeed, We know that among you are deniers.", "translation_id": "Dan sesungguhnya Kami benar-benar mengetahui bahwa di antara kamu ada orang yang mendustakan(nya)."}, {"number": 50, "text": "وَإِنَّهُۥ لَحَسْرَةٌ عَلَى ٱلْكَٰفِرِينَ", "translation_en": "And indeed, it will be [a cause of] regret upon the disbelievers.", "translation_id": "Dan sesungguhnya Al Quran itu benar-benar menjadi penyesalan bagi orang-orang kafir (di akhirat)."}, {"number": 51, "text": "وَإِنَّهُۥ لَحَقُّ ٱلْيَقِينِ", "translation_en": "And indeed, it is the truth of certainty.", "translation_id": "Dan sesungguhnya Al Quran itu benar-benar kebenaran yang diyakini."}, {"number": 52, "text": "فَسَبِّحْ بِٱسْمِ رَبِّكَ ٱلْعَظِيمِ", "translation_en": "So exalt the name of your Lord, the Most Great.", "translation_id": "Maka bertasbihlah dengan (menyebut) nama Tuhanmu Yang Maha Besar."}]}